# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
ip = input()
ipNetwork = ip[:ip.find('/')].split('.')
ipMask = ip[ip.find('/'):]
network = '''{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}'''.format(int(ipNetwork[0]), int(ipNetwork[1]), int(ipNetwork[2]), int(ipNetwork[3]))
maskBin = '1' * int(ipMask[1:])+'0' * (32-int(ipMask[1:]))
maskBin = (maskBin[:8]+' '+maskBin[8:16]+' ' +
           maskBin[16:24]+' '+maskBin[24:]).split()

mask = '''{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}'''.format(int(maskBin[0], 2), int(maskBin[1], 2), int(maskBin[2], 2), int(maskBin[3], 2))

out = f"Network:\n{network}\nMask:\n{ipMask}\n{mask}"
print(out)
